zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxPms_bf.h
/** \brief Offset for Ifx_PMS_EVRRSTCON_Bits.RSTCOFF */
#define IFX_PMS_EVRRSTCON_RSTCOFF_OFF (24u)

/** \brief Length for Ifx_PMS_EVRRSTCON_Bits.BPRSTCOFF */
#define IFX_PMS_EVRRSTCON_BPRSTCOFF_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRRSTCON_Bits.BPRSTCOFF */
#define IFX_PMS_EVRRSTCON_BPRSTCOFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRRSTCON_Bits.BPRSTCOFF */
#define IFX_PMS_EVRRSTCON_BPRSTCOFF_OFF (25u)

/** \brief Length for Ifx_PMS_EVRRSTCON_Bits.RST33OFF */
#define IFX_PMS_EVRRSTCON_RST33OFF_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRRSTCON_Bits.RST33OFF */
#define IFX_PMS_EVRRSTCON_RST33OFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRRSTCON_Bits.RST33OFF */
#define IFX_PMS_EVRRSTCON_RST33OFF_OFF (26u)

/** \brief Length for Ifx_PMS_EVRRSTCON_Bits.BPRST33OFF */
#define IFX_PMS_EVRRSTCON_BPRST33OFF_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRRSTCON_Bits.BPRST33OFF */
#define IFX_PMS_EVRRSTCON_BPRST33OFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRRSTCON_Bits.BPRST33OFF */
#define IFX_PMS_EVRRSTCON_BPRST33OFF_OFF (27u)

/** \brief Length for Ifx_PMS_EVRRSTCON_Bits.RSTSWDOFF */
#define IFX_PMS_EVRRSTCON_RSTSWDOFF_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRRSTCON_Bits.RSTSWDOFF */
#define IFX_PMS_EVRRSTCON_RSTSWDOFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRRSTCON_Bits.RSTSWDOFF */
#define IFX_PMS_EVRRSTCON_RSTSWDOFF_OFF (28u)

/** \brief Length for Ifx_PMS_EVRRSTCON_Bits.BPRSTSWDOFF */
#define IFX_PMS_EVRRSTCON_BPRSTSWDOFF_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRRSTCON_Bits.BPRSTSWDOFF */
#define IFX_PMS_EVRRSTCON_BPRSTSWDOFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRRSTCON_Bits.BPRSTSWDOFF */
#define IFX_PMS_EVRRSTCON_BPRSTSWDOFF_OFF (29u)

/** \brief Length for Ifx_PMS_EVRRSTCON_Bits.SLCK */
#define IFX_PMS_EVRRSTCON_SLCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRRSTCON_Bits.SLCK */
#define IFX_PMS_EVRRSTCON_SLCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRRSTCON_Bits.SLCK */
#define IFX_PMS_EVRRSTCON_SLCK_OFF (30u)

/** \brief Length for Ifx_PMS_EVRRSTSTAT_Bits.RSTC */
#define IFX_PMS_EVRRSTSTAT_RSTC_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRRSTSTAT_Bits.RSTC */
#define IFX_PMS_EVRRSTSTAT_RSTC_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRRSTSTAT_Bits.RSTC */
#define IFX_PMS_EVRRSTSTAT_RSTC_OFF (0u)

/** \brief Length for Ifx_PMS_EVRRSTSTAT_Bits.RST33 */
#define IFX_PMS_EVRRSTSTAT_RST33_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRRSTSTAT_Bits.RST33 */
#define IFX_PMS_EVRRSTSTAT_RST33_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRRSTSTAT_Bits.RST33 */
#define IFX_PMS_EVRRSTSTAT_RST33_OFF (8u)

/** \brief Length for Ifx_PMS_EVRRSTSTAT_Bits.RSTSWD */
#define IFX_PMS_EVRRSTSTAT_RSTSWD_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRRSTSTAT_Bits.RSTSWD */
#define IFX_PMS_EVRRSTSTAT_RSTSWD_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRRSTSTAT_Bits.RSTSWD */
#define IFX_PMS_EVRRSTSTAT_RSTSWD_OFF (16u)

/** \brief Length for Ifx_PMS_EVRRSTSTAT_Bits.RSTCOFF */
#define IFX_PMS_EVRRSTSTAT_RSTCOFF_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRRSTSTAT_Bits.RSTCOFF */
#define IFX_PMS_EVRRSTSTAT_RSTCOFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRRSTSTAT_Bits.RSTCOFF */
#define IFX_PMS_EVRRSTSTAT_RSTCOFF_OFF (24u)

/** \brief Length for Ifx_PMS_EVRRSTSTAT_Bits.RST33OFF */
#define IFX_PMS_EVRRSTSTAT_RST33OFF_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRRSTSTAT_Bits.RST33OFF */
#define IFX_PMS_EVRRSTSTAT_RST33OFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRRSTSTAT_Bits.RST33OFF */
#define IFX_PMS_EVRRSTSTAT_RST33OFF_OFF (26u)

/** \brief Length for Ifx_PMS_EVRRSTSTAT_Bits.RSTSWDOFF */
#define IFX_PMS_EVRRSTSTAT_RSTSWDOFF_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRRSTSTAT_Bits.RSTSWDOFF */
#define IFX_PMS_EVRRSTSTAT_RSTSWDOFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRRSTSTAT_Bits.RSTSWDOFF */
#define IFX_PMS_EVRRSTSTAT_RSTSWDOFF_OFF (28u)

/** \brief Length for Ifx_PMS_EVRTRIM_Bits.EVR33VOUTSEL */
#define IFX_PMS_EVRTRIM_EVR33VOUTSEL_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRTRIM_Bits.EVR33VOUTSEL */
#define IFX_PMS_EVRTRIM_EVR33VOUTSEL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRTRIM_Bits.EVR33VOUTSEL */
#define IFX_PMS_EVRTRIM_EVR33VOUTSEL_OFF (0u)

/** \brief Length for Ifx_PMS_EVRTRIM_Bits.SDVOUTSEL */
#define IFX_PMS_EVRTRIM_SDVOUTSEL_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRTRIM_Bits.SDVOUTSEL */
#define IFX_PMS_EVRTRIM_SDVOUTSEL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRTRIM_Bits.SDVOUTSEL */
#define IFX_PMS_EVRTRIM_SDVOUTSEL_OFF (8u)

/** \brief Length for Ifx_PMS_EVRTRIM_Bits.EVR33VOUTTRIM */
#define IFX_PMS_EVRTRIM_EVR33VOUTTRIM_LEN (6u)

/** \brief Mask for Ifx_PMS_EVRTRIM_Bits.EVR33VOUTTRIM */
#define IFX_PMS_EVRTRIM_EVR33VOUTTRIM_MSK (0x3fu)

/** \brief Offset for Ifx_PMS_EVRTRIM_Bits.EVR33VOUTTRIM */
#define IFX_PMS_EVRTRIM_EVR33VOUTTRIM_OFF (16u)

/** \brief Length for Ifx_PMS_EVRTRIM_Bits.SDVOUTTRIM */
#define IFX_PMS_EVRTRIM_SDVOUTTRIM_LEN (6u)

/** \brief Mask for Ifx_PMS_EVRTRIM_Bits.SDVOUTTRIM */
#define IFX_PMS_EVRTRIM_SDVOUTTRIM_MSK (0x3fu)

/** \brief Offset for Ifx_PMS_EVRTRIM_Bits.SDVOUTTRIM */
#define IFX_PMS_EVRTRIM_SDVOUTTRIM_OFF (24u)

/** \brief Length for Ifx_PMS_EVRTRIM_Bits.SLCK */
#define IFX_PMS_EVRTRIM_SLCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRTRIM_Bits.SLCK */
#define IFX_PMS_EVRTRIM_SLCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRTRIM_Bits.SLCK */
#define IFX_PMS_EVRTRIM_SLCK_OFF (30u)

/** \brief Length for Ifx_PMS_EVRTRIM_Bits.LCK */
#define IFX_PMS_EVRTRIM_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRTRIM_Bits.LCK */
#define IFX_PMS_EVRTRIM_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRTRIM_Bits.LCK */
#define IFX_PMS_EVRTRIM_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRTRIMSTAT_Bits.EVR33VOUTSEL */
#define IFX_PMS_EVRTRIMSTAT_EVR33VOUTSEL_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRTRIMSTAT_Bits.EVR33VOUTSEL */
#define IFX_PMS_EVRTRIMSTAT_EVR33VOUTSEL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRTRIMSTAT_Bits.EVR33VOUTSEL */
#define IFX_PMS_EVRTRIMSTAT_EVR33VOUTSEL_OFF (0u)

/** \brief Length for Ifx_PMS_EVRTRIMSTAT_Bits.SDVOUTSEL */
#define IFX_PMS_EVRTRIMSTAT_SDVOUTSEL_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRTRIMSTAT_Bits.SDVOUTSEL */
#define IFX_PMS_EVRTRIMSTAT_SDVOUTSEL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRTRIMSTAT_Bits.SDVOUTSEL */
#define IFX_PMS_EVRTRIMSTAT_SDVOUTSEL_OFF (8u)

/** \brief Length for Ifx_PMS_EVRTRIMSTAT_Bits.EVR33VOUTTRIM */
#define IFX_PMS_EVRTRIMSTAT_EVR33VOUTTRIM_LEN (6u)

/** \brief Mask for Ifx_PMS_EVRTRIMSTAT_Bits.EVR33VOUTTRIM */
#define IFX_PMS_EVRTRIMSTAT_EVR33VOUTTRIM_MSK (0x3fu)

/** \brief Offset for Ifx_PMS_EVRTRIMSTAT_Bits.EVR33VOUTTRIM */
#define IFX_PMS_EVRTRIMSTAT_EVR33VOUTTRIM_OFF (16u)

/** \brief Length for Ifx_PMS_EVRTRIMSTAT_Bits.SDVOUTTRIM */
#define IFX_PMS_EVRTRIMSTAT_SDVOUTTRIM_LEN (6u)

