zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxPms_bf.h
/** \brief Offset for Ifx_PMS_EVR33CON_Bits.SHLVEN */
#define IFX_PMS_EVR33CON_SHLVEN_OFF (13u)

/** \brief Length for Ifx_PMS_EVR33CON_Bits.SHVL33 */
#define IFX_PMS_EVR33CON_SHVL33_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR33CON_Bits.SHVL33 */
#define IFX_PMS_EVR33CON_SHVL33_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR33CON_Bits.SHVL33 */
#define IFX_PMS_EVR33CON_SHVL33_OFF (16u)

/** \brief Length for Ifx_PMS_EVR33CON_Bits.SLCK */
#define IFX_PMS_EVR33CON_SLCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR33CON_Bits.SLCK */
#define IFX_PMS_EVR33CON_SLCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR33CON_Bits.SLCK */
#define IFX_PMS_EVR33CON_SLCK_OFF (30u)

/** \brief Length for Ifx_PMS_EVROSCCTRL_Bits.OSCFTRIM */
#define IFX_PMS_EVROSCCTRL_OSCFTRIM_LEN (6u)

/** \brief Mask for Ifx_PMS_EVROSCCTRL_Bits.OSCFTRIM */
#define IFX_PMS_EVROSCCTRL_OSCFTRIM_MSK (0x3fu)

/** \brief Offset for Ifx_PMS_EVROSCCTRL_Bits.OSCFTRIM */
#define IFX_PMS_EVROSCCTRL_OSCFTRIM_OFF (0u)

/** \brief Length for Ifx_PMS_EVROSCCTRL_Bits.OSCFPTRIM */
#define IFX_PMS_EVROSCCTRL_OSCFPTRIM_LEN (6u)

/** \brief Mask for Ifx_PMS_EVROSCCTRL_Bits.OSCFPTRIM */
#define IFX_PMS_EVROSCCTRL_OSCFPTRIM_MSK (0x3fu)

/** \brief Offset for Ifx_PMS_EVROSCCTRL_Bits.OSCFPTRIM */
#define IFX_PMS_EVROSCCTRL_OSCFPTRIM_OFF (16u)

/** \brief Length for Ifx_PMS_EVROSCCTRL_Bits.OSCTEMPOFFS */
#define IFX_PMS_EVROSCCTRL_OSCTEMPOFFS_LEN (1u)

/** \brief Mask for Ifx_PMS_EVROSCCTRL_Bits.OSCTEMPOFFS */
#define IFX_PMS_EVROSCCTRL_OSCTEMPOFFS_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVROSCCTRL_Bits.OSCTEMPOFFS */
#define IFX_PMS_EVROSCCTRL_OSCTEMPOFFS_OFF (29u)

/** \brief Length for Ifx_PMS_EVROSCCTRL_Bits.OSCTRIMEN */
#define IFX_PMS_EVROSCCTRL_OSCTRIMEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVROSCCTRL_Bits.OSCTRIMEN */
#define IFX_PMS_EVROSCCTRL_OSCTRIMEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVROSCCTRL_Bits.OSCTRIMEN */
#define IFX_PMS_EVROSCCTRL_OSCTRIMEN_OFF (31u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.VEXTSTBYEN */
#define IFX_PMS_PMSWCR0_VEXTSTBYEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.VEXTSTBYEN */
#define IFX_PMS_PMSWCR0_VEXTSTBYEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.VEXTSTBYEN */
#define IFX_PMS_PMSWCR0_VEXTSTBYEN_OFF (2u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.VDDSTBYEN */
#define IFX_PMS_PMSWCR0_VDDSTBYEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.VDDSTBYEN */
#define IFX_PMS_PMSWCR0_VDDSTBYEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.VDDSTBYEN */
#define IFX_PMS_PMSWCR0_VDDSTBYEN_OFF (3u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.ESR0DFEN */
#define IFX_PMS_PMSWCR0_ESR0DFEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.ESR0DFEN */
#define IFX_PMS_PMSWCR0_ESR0DFEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.ESR0DFEN */
#define IFX_PMS_PMSWCR0_ESR0DFEN_OFF (4u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.ESR0EDCON */
#define IFX_PMS_PMSWCR0_ESR0EDCON_LEN (2u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.ESR0EDCON */
#define IFX_PMS_PMSWCR0_ESR0EDCON_MSK (0x3u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.ESR0EDCON */
#define IFX_PMS_PMSWCR0_ESR0EDCON_OFF (5u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.ESR1DFEN */
#define IFX_PMS_PMSWCR0_ESR1DFEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.ESR1DFEN */
#define IFX_PMS_PMSWCR0_ESR1DFEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.ESR1DFEN */
#define IFX_PMS_PMSWCR0_ESR1DFEN_OFF (7u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.ESR1EDCON */
#define IFX_PMS_PMSWCR0_ESR1EDCON_LEN (2u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.ESR1EDCON */
#define IFX_PMS_PMSWCR0_ESR1EDCON_MSK (0x3u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.ESR1EDCON */
#define IFX_PMS_PMSWCR0_ESR1EDCON_OFF (8u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.PINADFEN */
#define IFX_PMS_PMSWCR0_PINADFEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.PINADFEN */
#define IFX_PMS_PMSWCR0_PINADFEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.PINADFEN */
#define IFX_PMS_PMSWCR0_PINADFEN_OFF (10u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.PINAEDCON */
#define IFX_PMS_PMSWCR0_PINAEDCON_LEN (2u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.PINAEDCON */
#define IFX_PMS_PMSWCR0_PINAEDCON_MSK (0x3u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.PINAEDCON */
#define IFX_PMS_PMSWCR0_PINAEDCON_OFF (11u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.PINBDFEN */
#define IFX_PMS_PMSWCR0_PINBDFEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.PINBDFEN */
#define IFX_PMS_PMSWCR0_PINBDFEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.PINBDFEN */
#define IFX_PMS_PMSWCR0_PINBDFEN_OFF (13u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.PINBEDCON */
#define IFX_PMS_PMSWCR0_PINBEDCON_LEN (2u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.PINBEDCON */
#define IFX_PMS_PMSWCR0_PINBEDCON_MSK (0x3u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.PINBEDCON */
#define IFX_PMS_PMSWCR0_PINBEDCON_OFF (14u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.STBYRAMSEL */
#define IFX_PMS_PMSWCR0_STBYRAMSEL_LEN (3u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.STBYRAMSEL */
#define IFX_PMS_PMSWCR0_STBYRAMSEL_MSK (0x7u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.STBYRAMSEL */
#define IFX_PMS_PMSWCR0_STBYRAMSEL_OFF (16u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.BLNKFIL */
#define IFX_PMS_PMSWCR0_BLNKFIL_LEN (4u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.BLNKFIL */
#define IFX_PMS_PMSWCR0_BLNKFIL_MSK (0xfu)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.BLNKFIL */
#define IFX_PMS_PMSWCR0_BLNKFIL_OFF (20u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.ESR0WKEN */
#define IFX_PMS_PMSWCR0_ESR0WKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.ESR0WKEN */
#define IFX_PMS_PMSWCR0_ESR0WKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.ESR0WKEN */
#define IFX_PMS_PMSWCR0_ESR0WKEN_OFF (24u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.ESR1WKEN */
#define IFX_PMS_PMSWCR0_ESR1WKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.ESR1WKEN */
#define IFX_PMS_PMSWCR0_ESR1WKEN_MSK (0x1u)

