zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxPms_bf.h
/** \brief Length for Ifx_PMS_EVRSDCOEFF9_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF9_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF9_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF9_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF9_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF9_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_AG_STDBY0_Bits.SF4 */
#define IFX_PMS_AG_STDBY0_SF4_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY0_Bits.SF4 */
#define IFX_PMS_AG_STDBY0_SF4_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY0_Bits.SF4 */
#define IFX_PMS_AG_STDBY0_SF4_OFF (4u)

/** \brief Length for Ifx_PMS_AG_STDBY0_Bits.SF5 */
#define IFX_PMS_AG_STDBY0_SF5_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY0_Bits.SF5 */
#define IFX_PMS_AG_STDBY0_SF5_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY0_Bits.SF5 */
#define IFX_PMS_AG_STDBY0_SF5_OFF (5u)

/** \brief Length for Ifx_PMS_AG_STDBY0_Bits.SF6 */
#define IFX_PMS_AG_STDBY0_SF6_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY0_Bits.SF6 */
#define IFX_PMS_AG_STDBY0_SF6_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY0_Bits.SF6 */
#define IFX_PMS_AG_STDBY0_SF6_OFF (6u)

/** \brief Length for Ifx_PMS_AG_STDBY0_Bits.SF7 */
#define IFX_PMS_AG_STDBY0_SF7_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY0_Bits.SF7 */
#define IFX_PMS_AG_STDBY0_SF7_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY0_Bits.SF7 */
#define IFX_PMS_AG_STDBY0_SF7_OFF (7u)

/** \brief Length for Ifx_PMS_AG_STDBY0_Bits.SF8 */
#define IFX_PMS_AG_STDBY0_SF8_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY0_Bits.SF8 */
#define IFX_PMS_AG_STDBY0_SF8_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY0_Bits.SF8 */
#define IFX_PMS_AG_STDBY0_SF8_OFF (8u)

/** \brief Length for Ifx_PMS_AG_STDBY0_Bits.SF9 */
#define IFX_PMS_AG_STDBY0_SF9_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY0_Bits.SF9 */
#define IFX_PMS_AG_STDBY0_SF9_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY0_Bits.SF9 */
#define IFX_PMS_AG_STDBY0_SF9_OFF (9u)

/** \brief Length for Ifx_PMS_AG_STDBY0_Bits.SF10 */
#define IFX_PMS_AG_STDBY0_SF10_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY0_Bits.SF10 */
#define IFX_PMS_AG_STDBY0_SF10_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY0_Bits.SF10 */
#define IFX_PMS_AG_STDBY0_SF10_OFF (10u)

/** \brief Length for Ifx_PMS_AG_STDBY0_Bits.SF11 */
#define IFX_PMS_AG_STDBY0_SF11_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY0_Bits.SF11 */
#define IFX_PMS_AG_STDBY0_SF11_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY0_Bits.SF11 */
#define IFX_PMS_AG_STDBY0_SF11_OFF (11u)

/** \brief Length for Ifx_PMS_AG_STDBY0_Bits.SF12 */
#define IFX_PMS_AG_STDBY0_SF12_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY0_Bits.SF12 */
#define IFX_PMS_AG_STDBY0_SF12_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY0_Bits.SF12 */
#define IFX_PMS_AG_STDBY0_SF12_OFF (12u)

/** \brief Length for Ifx_PMS_AG_STDBY0_Bits.SF13 */
#define IFX_PMS_AG_STDBY0_SF13_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY0_Bits.SF13 */
#define IFX_PMS_AG_STDBY0_SF13_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY0_Bits.SF13 */
#define IFX_PMS_AG_STDBY0_SF13_OFF (13u)

/** \brief Length for Ifx_PMS_AG_STDBY0_Bits.SF14 */
#define IFX_PMS_AG_STDBY0_SF14_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY0_Bits.SF14 */
#define IFX_PMS_AG_STDBY0_SF14_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY0_Bits.SF14 */
#define IFX_PMS_AG_STDBY0_SF14_OFF (14u)

/** \brief Length for Ifx_PMS_AG_STDBY0_Bits.SF15 */
#define IFX_PMS_AG_STDBY0_SF15_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY0_Bits.SF15 */
#define IFX_PMS_AG_STDBY0_SF15_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY0_Bits.SF15 */
#define IFX_PMS_AG_STDBY0_SF15_OFF (15u)

/** \brief Length for Ifx_PMS_AG_STDBY0_Bits.FSPERR */
#define IFX_PMS_AG_STDBY0_FSPERR_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY0_Bits.FSPERR */
#define IFX_PMS_AG_STDBY0_FSPERR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY0_Bits.FSPERR */
#define IFX_PMS_AG_STDBY0_FSPERR_OFF (30u)

/** \brief Length for Ifx_PMS_AG_STDBY1_Bits.SF0 */
#define IFX_PMS_AG_STDBY1_SF0_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY1_Bits.SF0 */
#define IFX_PMS_AG_STDBY1_SF0_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY1_Bits.SF0 */
#define IFX_PMS_AG_STDBY1_SF0_OFF (0u)

/** \brief Length for Ifx_PMS_AG_STDBY1_Bits.SF1 */
#define IFX_PMS_AG_STDBY1_SF1_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY1_Bits.SF1 */
#define IFX_PMS_AG_STDBY1_SF1_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY1_Bits.SF1 */
#define IFX_PMS_AG_STDBY1_SF1_OFF (1u)

/** \brief Length for Ifx_PMS_AG_STDBY1_Bits.SF2 */
#define IFX_PMS_AG_STDBY1_SF2_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY1_Bits.SF2 */
#define IFX_PMS_AG_STDBY1_SF2_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY1_Bits.SF2 */
#define IFX_PMS_AG_STDBY1_SF2_OFF (2u)

/** \brief Length for Ifx_PMS_AG_STDBY1_Bits.SF3 */
#define IFX_PMS_AG_STDBY1_SF3_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY1_Bits.SF3 */
#define IFX_PMS_AG_STDBY1_SF3_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY1_Bits.SF3 */
#define IFX_PMS_AG_STDBY1_SF3_OFF (3u)

/** \brief Length for Ifx_PMS_AG_STDBY1_Bits.SF4 */
#define IFX_PMS_AG_STDBY1_SF4_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY1_Bits.SF4 */
#define IFX_PMS_AG_STDBY1_SF4_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY1_Bits.SF4 */
#define IFX_PMS_AG_STDBY1_SF4_OFF (4u)

/** \brief Length for Ifx_PMS_AG_STDBY1_Bits.SF5 */
#define IFX_PMS_AG_STDBY1_SF5_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY1_Bits.SF5 */
#define IFX_PMS_AG_STDBY1_SF5_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY1_Bits.SF5 */
#define IFX_PMS_AG_STDBY1_SF5_OFF (5u)

/** \brief Length for Ifx_PMS_AG_STDBY1_Bits.SF7 */
#define IFX_PMS_AG_STDBY1_SF7_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY1_Bits.SF7 */
#define IFX_PMS_AG_STDBY1_SF7_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AG_STDBY1_Bits.SF7 */
#define IFX_PMS_AG_STDBY1_SF7_OFF (7u)

/** \brief Length for Ifx_PMS_AG_STDBY1_Bits.SF8 */
#define IFX_PMS_AG_STDBY1_SF8_LEN (1u)

/** \brief Mask for Ifx_PMS_AG_STDBY1_Bits.SF8 */
#define IFX_PMS_AG_STDBY1_SF8_MSK (0x1u)

